app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments"
---
  def index
    respond_with Comment.all